```gantt
    title 食堂课题研究进度表
    section 研究项目
        指定计划 :a1, 2018-04-05, 1d
        背景了解 :2018-04-06,2d
        现场调研 : 2018-04-06,15d
        问卷调查 :2018-04-11, 5d
        实地访谈 :2018-04-16, 5d
        分析现状 :2018-04-17, 3d
        周围考察 :2018-04-18, 3d
        网上调研 : 2018-04-22,3d
        文献查找 : 2018-04-25,3d
        布局优化 : 2018-04-27,20d
        管理优化 :2018-05-02,20d
        实践感悟 :2018-05-10,2d
        报告总结 :2018-05-12,10d
        课题汇报 :2018-05-23,1d
```

```gantt
    title 项目开发流程
    section 项目确定
        需求分析       :a1, 2016-06-22, 3d
        可行性报告     :after a1, 5d
        概念验证       : 5d
    section 项目实施
        概要设计      :2016-07-05  , 5d
        详细设计      :2016-07-08, 10d
        编码          :2016-07-15, 10d
        测试          :2016-07-22, 5d
    section 发布验收
        发布: 2d
        验收: 3d
```
